//코딩을 하다보면 자바스크립트나 언어 자체에서 제공하는 API를 이용할 때 물론, 공식문서를 볼 수 있지만
// 하나 하나 확인하는 것보다 빠르게 API 정의되어 있는 곳으로 가서 코멘트를 보면서 이렇게 이용하는 거구나 확인하는 것이 더 도움 된다고 한다.

//command를 누른채 Array; 에 마우스를 가져가면 클릭이 활성화 된다.
Array;
// 클릭하면 정의되어 있는 것으로 들어갈 수 있다.
// lib.es5.d.ts 는 타입스크립트 받으면 자동으로 나오는 파일인데
// d라는 것은 타입 definition으로 타입이 정의 된 것이다.
// 타입스크립트 팀에서 자바스크립트 코드를 작성하면서 자바스크립트 라이브러리르 써야할 때 자바스크립트 언어자체에서 제공하는 Array같은 아이들을 사용할 때
// 타입 정보가 없는 자바스크립트만을 이용하면 힘드니까 조금 더 명확하게 타입이 어떤 것인지 확인할 수 있도록 추가적으로 타입을 정의해놓은 파일이다.

[1, 2, 3].map;
